#---------------------------------------------------------------------------------#
# 操作图像
#---------------------------------------------------------------------------------#
import os
from PIL import Image

print('当前路径：', os.path.abspath('.'))

# 打开一个jpg图像文件，注意是当前路径:
im = Image.open('/Users/suxin/Desktop/Self/Python/PythonProject/JPG/17_1_test.jpg')

# 获得图像尺寸:
w, h = im.size
print(w, h, im.size)
print('Original image size: %sx%s' % (w, h))
#---------------------------------------------------------------------------------#
# 缩放到50%:
#---------------------------------------------------------------------------------#
im.thumbnail((w//2, h//2))
print('Resize image to: %sx%s' % (w//2, h//2))
#---------------------------------------------------------------------------------#
# 切片图像 (左上角坐标, 右下角坐标)
# (x1, y1, x2, y2)
#---------------------------------------------------------------------------------#
p1 = im.crop((0, 0, 300, 300))
print('截图尺寸：', '\n', '(x1, y1, x2, y2)', '\n', '(0, 0, 300, 300)')
#---------------------------------------------------------------------------------#
# 图像旋转
#---------------------------------------------------------------------------------#
p2 = im.rotate(90)
#---------------------------------------------------------------------------------#

# 把缩放后的图像用jpeg格式保存:
im.save('/Users/suxin/Desktop/Self/Python/PythonProject/JPG/17_1_thumbnail.jpg', 'jpeg')
p1.save('/Users/suxin/Desktop/Self/Python/PythonProject/JPG/17_1_p1.jpg')
p2.save('/Users/suxin/Desktop/Self/Python/PythonProject/JPG/17_1_p2.jpg')
